rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-03-22 23:06:24.810669"], ["updated_at", "2016-03-22 23:06:24.810669"]]

  def show
    id = params[:id]
    @movie = Movie.find(id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]

  def findWithSameDirector
    @movie = Movie.find params[:id]

    @director = @movie.director
    if @director == nil || @director == ""
      redirect_to movies_path
      return
    end

    @movies = Movie.where(director: @director).all
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Yi Huangs"]]